W6D3/routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "haadi.munshi@gmail.com"], ["updated_at", "2020-09-02 16:37:51.439081"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)