W6D3/art_share/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "William"], ["updated_at", "2020-09-03 19:56:11.319042"], ["id", 6]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)