W6D4/art_share/app/controllers/artworks_controller.rb

    def index
        artworks = Artwork.where(artist_id: params[:user_id])
        shared_artwork_records = ArtworkShare.where(viewer_id: params[:user_id])

        shared_artworks = []
        shared_artwork_records.map do |shared_artwork_record|
            shared_artworks << shared_artwork_record.artwork
---
SELECT "artworks".* FROM "artworks" WHERE (params[:user_id] = params[:artist_id] and params[:user_id] = ArtworkShare.viewer_id)
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 17]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 16]]
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mona Lisa"], ["image_url", "othermona.com"], ["artist_id", 8], ["created_at", "2020-09-03 20:08:03.783327"], ["updated_at", "2020-09-03 20:08:03.783327"]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "othermonalisa.com"], ["updated_at", "2020-09-03 20:10:41.228645"], ["id", 7]]