W6D4/art_share/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            comments = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            comments = Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 26]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 23]]